#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_branch_protection.branch_protection["boring_project:bar"] will be created
  + resource "github_branch_protection" "branch_protection" {
      + allows_deletions        = false
      + allows_force_pushes     = false
      + enforce_admins          = true
      + id                      = (known after apply)
      + pattern                 = "bar"
      + repository_id           = (known after apply)
      + require_signed_commits  = false
      + required_linear_history = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + required_approving_review_count = 1
        }

      + required_status_checks {
          + contexts = [
              + "pull_request",
            ]
          + strict   = false
        }
    }

  # github_branch_protection.branch_protection["boring_project:foo"] will be created
  + resource "github_branch_protection" "branch_protection" {
      + allows_deletions        = false
      + allows_force_pushes     = false
      + enforce_admins          = true
      + id                      = (known after apply)
      + pattern                 = "foo"
      + repository_id           = (known after apply)
      + require_signed_commits  = false
      + required_linear_history = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + required_approving_review_count = 1
        }

      + required_status_checks {
          + contexts = [
              + "build",
              + "test",
            ]
          + strict   = false
        }
    }

  # github_branch_protection.branch_protection["empty_project:main"] will be created
  + resource "github_branch_protection" "branch_protection" {
      + allows_deletions        = false
      + allows_force_pushes     = false
      + enforce_admins          = true
      + id                      = (known after apply)
      + pattern                 = "main"
      + repository_id           = (known after apply)
      + require_signed_commits  = false
      + required_linear_history = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + required_approving_review_count = 1
        }

      + required_status_checks {
          + contexts = [
              + "pull_request",
            ]
          + strict   = false
        }
    }

  # github_branch_protection.branch_protection["really_cool_project:main"] will be created
  + resource "github_branch_protection" "branch_protection" {
      + allows_deletions        = false
      + allows_force_pushes     = false
      + enforce_admins          = true
      + id                      = (known after apply)
      + pattern                 = "main"
      + repository_id           = (known after apply)
      + require_signed_commits  = false
      + required_linear_history = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + required_approving_review_count = 1
        }

      + required_status_checks {
          + contexts = [
              + "pull_request",
            ]
          + strict   = false
        }
    }

  # github_membership.membership["Ryan Stewart"] will be created
  + resource "github_membership" "membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "admin"
      + username = "zzantozz"
    }

  # github_membership.membership["Sam Warters"] will be created
  + resource "github_membership" "membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "samwar"
    }

  # github_repository.repository["boring_project"] will be created
  + resource "github_repository" "repository" {
      + allow_merge_commit     = true
      + allow_rebase_merge     = false
      + allow_squash_merge     = false
      + archived               = false
      + auto_init              = true
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Humdrum old project"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "boring_project"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "internal"
    }

  # github_repository.repository["empty_project"] will be created
  + resource "github_repository" "repository" {
      + allow_merge_commit     = true
      + allow_rebase_merge     = false
      + allow_squash_merge     = false
      + archived               = false
      + auto_init              = true
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "empty_project"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
    }

  # github_repository.repository["really_cool_project"] will be created
  + resource "github_repository" "repository" {
      + allow_merge_commit     = true
      + allow_rebase_merge     = false
      + allow_squash_merge     = false
      + archived               = false
      + auto_init              = true
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "The best project in the world, ever"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "really_cool_project"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
    }

  # github_team.team["Team A"] will be created
  + resource "github_team" "team" {
      + create_default_maintainer = false
      + description               = "The best team"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "Team A"
      + node_id                   = (known after apply)
      + privacy                   = "secret"
      + slug                      = (known after apply)
    }

  # github_team.team["Team B"] will be created
  + resource "github_team" "team" {
      + create_default_maintainer = false
      + description               = "My people didn't give me a good description. Help me!"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "Team B"
      + node_id                   = (known after apply)
      + privacy                   = "secret"
      + slug                      = (known after apply)
    }

  # github_team_membership.membership["Team A:Ryan Stewart"] will be created
  + resource "github_team_membership" "membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "zzantozz"
    }

  # github_team_membership.membership["Team A:Sam Warters"] will be created
  + resource "github_team_membership" "membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "samwar"
    }

  # github_team_repository.team_repository["boring_project:Team B"] will be created
  + resource "github_team_repository" "team_repository" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "boring_project"
      + team_id    = (known after apply)
    }

  # github_team_repository.team_repository["really_cool_project:Team A"] will be created
  + resource "github_team_repository" "team_repository" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "really_cool_project"
      + team_id    = (known after apply)
    }

  # github_team_repository.team_repository["really_cool_project:Team B"] will be created
  + resource "github_team_repository" "team_repository" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "pull"
      + repository = "really_cool_project"
      + team_id    = (known after apply)
    }

Plan: 16 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + debug = {
      + boring_project:bar       = {
          + branch        = "bar"
          + repo          = "boring_project"
          + status_checks = [
              + "pull_request",
            ]
        }
      + boring_project:foo       = {
          + branch        = "foo"
          + repo          = "boring_project"
          + status_checks = [
              + "build",
              + "test",
            ]
        }
      + empty_project:main       = {
          + branch        = "main"
          + repo          = "empty_project"
          + status_checks = [
              + "pull_request",
            ]
        }
      + really_cool_project:main = {
          + branch        = "main"
          + repo          = "really_cool_project"
          + status_checks = [
              + "pull_request",
            ]
        }
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pusher: @zzantozz, Action: `pull_request`*